app/controllers/users_controller.rb

INSERT INTO `users` (`salt`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `activation_code`, `last_name`, `remember_token`, `login`, `email`, `first_name`) VALUES('909654112201a8a8d54db5ab07123f0bdb8cda36', '2010-04-30 20:01:34', NULL, '10d0c71591a3bdce0155496acfe6e65e6d2e29ed', NULL, '2010-04-30 20:01:34', 'dbd296a3e7331c853f1f0425a8712089b7d36836', '--- !map:HashWithIndifferentAccess {}\n\n', NULL, 'test', 'test@test.com', '--- !map:HashWithIndifferentAccess {}\n\n')
---
  def create_xml
    cookies.delete :auth_token
    @user = User.new(params[:user])
    @user.save

INSERT INTO `users` (`salt`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `activation_code`, `last_name`, `remember_token`, `login`, `email`, `first_name`) VALUES('7fc3eadd0e6100e4635eeeb6141e32cdba8b1b76', '2010-04-19 20:25:46', NULL, '7d52de0f30aeed6026cf13ebf5d6c62d4557aa3e', NULL, '2010-04-19 20:25:46', '975e59e8a4f63c071fca95c156fe6ff7bc4c9f79', NULL, NULL, 'nico', 'nico@mail.com', NULL)
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save

SELECT * FROM `users` WHERE (`users`.`activation_code` = '64d6bd4442e25be0228d29e3884210a7f1ae1a26') LIMIT 1
---
  def activate
    self.current_user = params[:activation_code].blank? ? false : User.find_by_activation_code(params[:activation_code])